backend/app/controllers/api/restaurants_controller.rb

SELECT "restaurants".* FROM "restaurants"
---
    def index
      restaurants = Restaurant.all